let xAxisData = [
  {
    name: "فروردین",
    فروش: 112_000,
  },
  {
    name: "اردیبهشت",
    فروش: 99_000,
  },
  {
    name: "خرداد",
    فروش: 12_090,
  },
  {
    name: "تیر",
    فروش: 99_000,
  },
  {
    name: "مرداد",
    فروش: 54_000,
  },
  {
    name: "شهریور",
    فروش: 85_000,
  },
  {
    name: "مهر",
    فروش: 34_000,
  },
  {
    name: "آبان",
    فروش: 18_598,
  },
  {
    name: "آذر",
    فروش: 0,
  },
  {
    name: "دی",
    فروش: 73_078,
  },
  {
    name: "بهمن",
    فروش: 12_900,
  },
  {
    name: "اسفند",
    فروش: 97_000,
  },
];


export default xAxisData;