import * as Yup from "yup";

const productSchema = Yup.object().shape({
  title: Yup.string()
    .min(3, "عنوان محصول حداقل باید 3 کاراکتر داشته باشه")
    .max(68, "عنوان محصول حداکثر باید 68 کاراکتر داشته باشه")
    .required("عنوان محصول را وارد نمایید"),
  price: Yup.string()
    .min(4, "قیمت محصول حداقل باید 4 رقم داشته باشه")
    .max(10, "قیمت محصول حداکثر باید 10 رقم داشته باشه")
    .required("قیمت محصول را وارد نمایید"),
  count: Yup.string()
    .min(1, "تعداد محصول حداقل باید 1 رقم داشته باشه")
    .max(10, "تعداد محصول حداکثر باید 10 رقم داشته باشه")
    .required("تعداد محصول را وارد نمایید"),
  colorCount: Yup.string()
    .min(1, "تعداد رنگ محصول حداقل باید 1 رقم داشته باشه")
    .max(10, "تعداد رنگ محصول حداکثر باید 10 رقم داشته باشه")
    .required("تعداد رنگ محصول را وارد نمایید"),
  off: Yup.string()
    .min(1, "تخفیف محصول حداقل باید 1 رقم داشته باشه")
    .max(2, " تخفیف محصول حداکثر باید 2 رقم داشته باشه")
    .required(" تخفیف محصول را وارد نمایید"),
  link: Yup.string()
    .min(3, "لینک محصول حداقل باید 3 کاراکتر داشته باشه")
    .max(14, " لینک محصول حداکثر باید 14 کاراکتر داشته باشه")
    .required(" لینک محصول را وارد نمایید"),
  shortDesc: Yup.string()
    .min(5, "توضیحات کوتاه محصول حداقل باید 5 کاراکتر داشته باشه")
    .max(100, " توضیحات کوتاه محصول حداکثر باید 100 کاراکتر داشته باشه")
    .required(" توضیحات کوتاه محصول را وارد نمایید"),
  longDesc: Yup.string()
    .min(5, "توضیحات بلند محصول حداقل باید 5 کاراکتر داشته باشه")
    .max(100, " توضیحات بلند محصول حداکثر باید 100 کاراکتر داشته باشه")
    .required(" توضیحات بلند محصول را وارد نمایید"),
  category: Yup.string().required("دسته بندی را انتخاب کنید"),
});

export { productSchema };
