import * as Yup from "yup";

const addressSchema = Yup.object().shape({
  address: Yup.string()
    .min(8, " آدرس حداقل باید 20 کاراکتر داشته باشه")
    .max(60, " آدرس حداکثر باید 60 کاراکتر داشته باشه")
    .required(" آدرس را وارد نمایید"),
  email: Yup.string()
    .email("ایمیل وارد شده معتبر نمی‌باشد")
    .min(10, "ایمیل حداقل باید 10 کاراکتر داشته باشه")
    .max(30, "ایمیل حداکثر باید 30 کاراکتر داشته باشه")
    .required("ایمیل را وارد نمایید"),
  telegram: Yup.string()
    .min(8, " آدرس تلگرام حداقل باید 8 کاراکتر داشته باشه")
    .max(60, " آدرس  تلگرام حداکثر باید 60 کاراکتر داشته باشه")
    .required(" آدرس  تلگرام را وارد نمایید"),
  instagram: Yup.string()
    .min(8, " آدرس اینستاگرام حداقل باید 8 کاراکتر داشته باشه")
    .max(60, " آدرس  اینستاگرام حداکثر باید 60 کاراکتر داشته باشه")
    .required(" آدرس  اینستاگرام را وارد نمایید"),
  phone: Yup.string()
    .min(11, "شماره حداقل باید 11 کاراکتر داشته باشه")
    .max(11, "شماره حداکثر باید 11 کاراکتر داشته باشه")
    .required("شماره را وارد نمایید"),
});

export { addressSchema };
